app/controllers/home_controller.rb

SELECT  "parsings".* FROM "parsings"  ORDER BY "parsings"."id" ASC LIMIT 10
---
  def index
    @parsings = Parsing.all.first(10)