app/controllers/parsings_controller.rb

INSERT INTO "parsings" ("snapshot", "name", "schema_attachment_file_name", "schema_attachment_content_type", "schema_attachment_file_size", "schema_attachment_updated_at", "xml_attachment_file_name", "xml_attachment_content_type", "xml_attachment_file_size", "xml_attachment_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    respond_with(@parsing = Parsing.create(parsing_params))